var array = {
    azarbyjan : [' میانه',' سراب',' مرند',' چاراویماق',' اهر',' بستان‌آباد ',' شبستر  ',' ورزقان',' هریس',' مراغه',' تبریز',' کلیبر',' هشترود',' اسکو',' جلفا',' خداآفرین',' ملکان،',' آذرشهر',' بناب',' عجب‌شیر ',' ','هوراند'],
    tehran : ['تهران',' شهریار،',' اسلام‍شهر،',' بهارستان،',' ملارد،',' پاکدشت،',' ری،',' قدس،',' رباط‌کریم،',' ورامین،',' قرچک،',' پردیس،',' دماوند،',' پیشوا،',' شمیرانات',' و فیروزکوه'],
    ardabil :['بیله سوار',' پارس‌آباد،',' خلخال،',' مشكين‌شهر،',' مغان،',' نمين،',' نير ','کوثر'],
    arak : ['اراک',' دلیجان،',' محلات،',' ساوه،',' تفرش،',' خمین،',' فراهان،',' شازند،',' آشتیان،',' کمیجان،',' زرندیه',' ',' خنداب']

}

var OstanName = prompt(" which ostan ? ")

console.log(array[OstanName]);
